---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.NodeType
source: html/69a337fb-627e-d669-de4e-91dcad69c541.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.NodeType Property

The type of electrical analytical node.

## Syntax (C#)
```csharp
public ElectricalAnalyticalNodeType NodeType { get; }
```